Table of Contents
 Class GrpcBlobStorageService
Namespace
IdeaStatiCa.Plugin.Grpc.Services
Assembly
IdeaStatiCa.Plugin.dll
Service in gRPC server for blob storage communication
public class GrpcBlobStorageService : GrpcBlobStorageService.GrpcBlobStorageServiceBase
Inheritance
object
GrpcBlobStorageService.GrpcBlobStorageServiceBase
GrpcBlobStorageService
Inherited Members
 object.ToString()
 object.Equals(object)
 object.Equals(object, object)
 object.ReferenceEquals(object, object)
 object.GetHashCode()
 object.GetType()
 object.MemberwiseClone()
Constructors
 GrpcBlobStorageService(IPluginLogger, IBlobStorageProvider, int)
Creates gRPC blob storage service
public GrpcBlobStorageService(IPluginLogger logger, IBlobStorageProvider blobStorageProvider, int chunkSize = 65536)
Parameters
logger IPluginLogger
Logger
blobStorageProvider IBlobStorageProvider
Provider of blob storages
chunkSize int
Size of chunk in bytes
Methods
 Delete(ContentRequest, ServerCallContext)
Deletes specified content in specified blob storage
public override Task<VoidResponse> Delete(ContentRequest request, ServerCallContext context)
Parameters
request ContentRequest
Request contains BlobStorageId and ContentId
context ServerCallContext
Call context of gRPC communication
Returns
Task<VoidResponse>
 Exist(ContentRequest, ServerCallContext)
Determines if content with specified content id exists in specified blob storage
public override Task<ExistResponse> Exist(ContentRequest request, ServerCallContext context)
Parameters
request ContentRequest
Request contains BlobStorageId and ContentId
context ServerCallContext
Call context of gRPC communication
Returns
Task<ExistResponse>
 GetEntries(GetEntriesRequest, ServerCallContext)
Get list of all content ids in specified blob storage
public override Task<GetEntriesResponse> GetEntries(GetEntriesRequest request, ServerCallContext context)
Parameters
request GetEntriesRequest
Request contains BlobStorageId
context ServerCallContext
Call context of gRPC communication
Returns
Task<GetEntriesResponse>
 Read(ContentRequest, IServerStreamWriter<ContentData>, ServerCallContext)
Reads data with content id from the specified blob storage
public override Task Read(ContentRequest request, IServerStreamWriter<ContentData> responseStream, ServerCallContext context)
Parameters
request ContentRequest
Request contains BlobStorageId and ContentId
responseStream IServerStreamWriter<ContentData>
Streamed data to be read from the blob storage and sent to the client
context ServerCallContext
Call context of gRPC communication
Returns
Task
 Write(IAsyncStreamReader<ContentData>, ServerCallContext)
public override Task<VoidResponse> Write(IAsyncStreamReader<ContentData> requestStream, ServerCallContext context)
Parameters
requestStream IAsyncStreamReader<ContentData>
context ServerCallContext
Returns
Task<VoidResponse>
 Edit this page